//#pragma warning(disable:4996)
//#include <stdio.h>
////思路：从x下标开始，从前往后，后一个数给前一个数赋值。注意：不能从后往前，后一个给前一个赋值，那样会导致x下标往后的数字都变成同一个数字！！！
//int main()
//{
//	int len, x, i, j, a[100];
//	printf("请输入数组的长度：");
//	scanf("%d",&len);               //输入数组的长度
//	printf("请输入数组的内容：");
//	for (i = 0; i < len; i++)
//	{
//		scanf("%d",&a[i]);          //输入数组的内容
//	}
//	printf("请输入要删除的数字的下标:");
//	scanf("%d",&x);                 //输入要删除的数字的下标
//	for (j = x; j < len - 1; j++)
//	{
//		a[j] = a[j + 1];            //从下标x开始，后一个给前一个赋值
//	}
//	for (i = 0; i < len - 1; i++)      //len - 1是删除一个数之后，数组的长度要减去1
//	{
//		printf("%d ",a[i]);
//	}
//	return 0;
//}